wicanr2/arduino-due-with-sam3a8c/sam/1.6.4/boards.txt

arduino_due_x_dbg.name=Arduino Due (Programming Port)
arduino_due_x_dbg.vid.0=0x2341
arduino_due_x_dbg.pid.0=0x003d
arduino_due_x_dbg.vid.1=0x2A03
arduino_due_x_dbg.pid.1=0x003d
arduino_due_x_dbg.upload.tool=bossac
arduino_due_x_dbg.upload.protocol=sam-ba
arduino_due_x_dbg.upload.maximum_size=524288
arduino_due_x_dbg.upload.use_1200bps_touch=true
arduino_due_x_dbg.upload.wait_for_upload_port=false
arduino_due_x_dbg.upload.native_usb=false
arduino_due_x_dbg.build.mcu=cortex-m3
arduino_due_x_dbg.build.f_cpu=84000000L
arduino_due_x_dbg.build.usb_product="Arduino Due"
arduino_due_x_dbg.build.board=SAM_DUE
arduino_due_x_dbg.build.core=arduino
arduino_due_x_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due_x_dbg.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_x_dbg.build.variant=arduino_due_x
arduino_due_x_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_x_dbg.build.vid=0x2341
arduino_due_x_dbg.build.pid=0x003e

arduino_due_x.name=Arduino Due (Native USB Port)
arduino_due_x.vid.0=0x2341
arduino_due_x.pid.0=0x003e
arduino_due_x.vid.1=0x2A03
arduino_due_x.pid.1=0x003e
arduino_due_x.upload.tool=bossac
arduino_due_x.upload.protocol=sam-ba
arduino_due_x.upload.maximum_size=524288
arduino_due_x.upload.use_1200bps_touch=true
arduino_due_x.upload.wait_for_upload_port=true
arduino_due_x.upload.native_usb=true
arduino_due_x.build.mcu=cortex-m3
arduino_due_x.build.f_cpu=84000000L
arduino_due_x.build.usb_product="Arduino Due"
arduino_due_x.build.board=SAM_DUE
arduino_due_x.build.core=arduino
arduino_due_x.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due_x.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_x.build.variant=arduino_due_x
arduino_due_x.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_x.build.vid=0x2341
arduino_due_x.build.pid=0x003e

arduino_due_y.name=Arduino Due Y SAM3X8C by WJY (Native USB Port) 
arduino_due_y.vid.0=0x2341
arduino_due_y.pid.0=0x003e
arduino_due_y.vid.1=0x2A03
arduino_due_y.pid.1=0x003e
arduino_due_y.upload.tool=bossac
arduino_due_y.upload.protocol=sam-ba
arduino_due_y.upload.maximum_size=524288
arduino_due_y.upload.use_1200bps_touch=true
arduino_due_y.upload.wait_for_upload_port=true
arduino_due_y.upload.native_usb=true
arduino_due_y.build.mcu=cortex-m3
arduino_due_y.build.f_cpu=84000000L
arduino_due_y.build.usb_product="Arduino Due"
arduino_due_y.build.board=SAM_DUE
arduino_due_y.build.core=arduino
arduino_due_y.build.extra_flags=-D__SAM3X8C__ -mthumb {build.usb_flags}
arduino_due_y.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_y.build.variant=arduino_due_y
arduino_due_y.build.variant_system_lib=libsam_sam3x8c_gcc_rel.a
arduino_due_y.build.vid=0x2341
arduino_due_y.build.pid=0x003e

sam3a8c_due.name=Arduino Due Z SAM3A8C by WJY (Native USB Port) 
sam3a8c_due.vid.0=0x2341
sam3a8c_due.pid.0=0x003e
sam3a8c_due.vid.1=0x2A03
sam3a8c_due.pid.1=0x003e
sam3a8c_due.upload.tool=bossac_sam3a8c
sam3a8c_due.upload.protocol=sam-ba
sam3a8c_due.upload.maximum_size=524288
sam3a8c_due.upload.use_1200bps_touch=true
sam3a8c_due.upload.wait_for_upload_port=true
sam3a8c_due.upload.native_usb=true
sam3a8c_due.build.mcu=cortex-m3
sam3a8c_due.build.f_cpu=84000000L
sam3a8c_due.build.usb_product="Arduino Due"
sam3a8c_due.build.board=SAM_DUE
sam3a8c_due.build.core=arduino
sam3a8c_due.build.extra_flags=-D__SAM3A8C__ -mthumb {build.usb_flags}
sam3a8c_due.build.ldscript=linker_scripts/gcc/flash.ld
sam3a8c_due.build.variant=sam3a8c_due
sam3a8c_due.build.variant_system_lib=libsam_sam3a8c_gcc_rel.a
sam3a8c_due.build.vid=0x2341
sam3a8c_due.build.pid=0x003e
